Revit 2026 API

# IFCHybridImportOptions Class

---

A set of options to decide on extra AnyCAD processing.

SystemObject Autodesk.Revit.DB.IFCIFCHybridImportOptions

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCHybridImportOptions : IDisposable
```
```vb
Public Class IFCHybridImportOptions
	Implements IDisposable
```
```cpp
public ref class IFCHybridImportOptions : IDisposable
```
```fsharp
type IFCHybridImportOptions =
    class
        interface IDisposable
    end
```

The IFCHybridImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HybridGrids | True if we should use AnyCAD to process grids, false otherwise. |
|  | HybridLevels | True if we should use AnyCAD to process levels, false otherwise. |
|  | HybridPropertySets | True if we should use AnyCAD to process property sets, false otherwise. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Create a IFCHybridImportOptions from an options string, or null if it isn't hybrid mode. |
|  | Dispose | Releases all resources used by the IFCHybridImportOptions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | ToString(IFCHybridImportOptions) | Converts the IFCHybridImportOptions class to a revit.ini-compatible string. |

#### Reference

Autodesk.Revit.DB.IFC Namespace